7767517
160 172
Input            input.1                  0 1 input.1
Convolution      336                      1 1 input.1 336 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1728
BatchNorm        337                      1 1 336 337 0=64
PReLU            339                      1 1 337 339 0=64
ConvolutionDepthWise 340                      1 1 339 340 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=576 7=64
BatchNorm        341                      1 1 340 341 0=64
PReLU            343                      1 1 341 343 0=64
Convolution      344                      1 1 343 344 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        345                      1 1 344 345 0=128
PReLU            347                      1 1 345 347 0=128
ConvolutionDepthWise 348                      1 1 347 348 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        349                      1 1 348 349 0=128
PReLU            351                      1 1 349 351 0=128
Convolution      352                      1 1 351 352 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        353                      1 1 352 353 0=64
Split            splitncnn_0              1 2 353 353_splitncnn_0 353_splitncnn_1
Convolution      354                      1 1 353_splitncnn_1 354 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        355                      1 1 354 355 0=128
PReLU            357                      1 1 355 357 0=128
ConvolutionDepthWise 358                      1 1 357 358 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        359                      1 1 358 359 0=128
PReLU            361                      1 1 359 361 0=128
Convolution      362                      1 1 361 362 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        363                      1 1 362 363 0=64
BinaryOp         364                      2 1 353_splitncnn_0 363 364 0=0
Split            splitncnn_1              1 2 364 364_splitncnn_0 364_splitncnn_1
Convolution      365                      1 1 364_splitncnn_1 365 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        366                      1 1 365 366 0=128
PReLU            368                      1 1 366 368 0=128
ConvolutionDepthWise 369                      1 1 368 369 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        370                      1 1 369 370 0=128
PReLU            372                      1 1 370 372 0=128
Convolution      373                      1 1 372 373 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        374                      1 1 373 374 0=64
BinaryOp         375                      2 1 364_splitncnn_0 374 375 0=0
Split            splitncnn_2              1 2 375 375_splitncnn_0 375_splitncnn_1
Convolution      376                      1 1 375_splitncnn_1 376 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        377                      1 1 376 377 0=128
PReLU            379                      1 1 377 379 0=128
ConvolutionDepthWise 380                      1 1 379 380 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        381                      1 1 380 381 0=128
PReLU            383                      1 1 381 383 0=128
Convolution      384                      1 1 383 384 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        385                      1 1 384 385 0=64
BinaryOp         386                      2 1 375_splitncnn_0 385 386 0=0
Split            splitncnn_3              1 2 386 386_splitncnn_0 386_splitncnn_1
Convolution      387                      1 1 386_splitncnn_1 387 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        388                      1 1 387 388 0=128
PReLU            390                      1 1 388 390 0=128
ConvolutionDepthWise 391                      1 1 390 391 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        392                      1 1 391 392 0=128
PReLU            394                      1 1 392 394 0=128
Convolution      395                      1 1 394 395 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        396                      1 1 395 396 0=64
BinaryOp         397                      2 1 386_splitncnn_0 396 397 0=0
Convolution      398                      1 1 397 398 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        399                      1 1 398 399 0=256
PReLU            401                      1 1 399 401 0=256
ConvolutionDepthWise 402                      1 1 401 402 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        403                      1 1 402 403 0=256
PReLU            405                      1 1 403 405 0=256
Convolution      406                      1 1 405 406 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        407                      1 1 406 407 0=128
Split            splitncnn_4              1 2 407 407_splitncnn_0 407_splitncnn_1
Convolution      408                      1 1 407_splitncnn_1 408 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        409                      1 1 408 409 0=256
PReLU            411                      1 1 409 411 0=256
ConvolutionDepthWise 412                      1 1 411 412 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        413                      1 1 412 413 0=256
PReLU            415                      1 1 413 415 0=256
Convolution      416                      1 1 415 416 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        417                      1 1 416 417 0=128
BinaryOp         418                      2 1 407_splitncnn_0 417 418 0=0
Split            splitncnn_5              1 2 418 418_splitncnn_0 418_splitncnn_1
Convolution      419                      1 1 418_splitncnn_1 419 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        420                      1 1 419 420 0=256
PReLU            422                      1 1 420 422 0=256
ConvolutionDepthWise 423                      1 1 422 423 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        424                      1 1 423 424 0=256
PReLU            426                      1 1 424 426 0=256
Convolution      427                      1 1 426 427 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        428                      1 1 427 428 0=128
BinaryOp         429                      2 1 418_splitncnn_0 428 429 0=0
Split            splitncnn_6              1 2 429 429_splitncnn_0 429_splitncnn_1
Convolution      430                      1 1 429_splitncnn_1 430 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        431                      1 1 430 431 0=256
PReLU            433                      1 1 431 433 0=256
ConvolutionDepthWise 434                      1 1 433 434 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        435                      1 1 434 435 0=256
PReLU            437                      1 1 435 437 0=256
Convolution      438                      1 1 437 438 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        439                      1 1 438 439 0=128
BinaryOp         440                      2 1 429_splitncnn_0 439 440 0=0
Split            splitncnn_7              1 2 440 440_splitncnn_0 440_splitncnn_1
Convolution      441                      1 1 440_splitncnn_1 441 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        442                      1 1 441 442 0=256
PReLU            444                      1 1 442 444 0=256
ConvolutionDepthWise 445                      1 1 444 445 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        446                      1 1 445 446 0=256
PReLU            448                      1 1 446 448 0=256
Convolution      449                      1 1 448 449 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        450                      1 1 449 450 0=128
BinaryOp         451                      2 1 440_splitncnn_0 450 451 0=0
Split            splitncnn_8              1 2 451 451_splitncnn_0 451_splitncnn_1
Convolution      452                      1 1 451_splitncnn_1 452 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        453                      1 1 452 453 0=256
PReLU            455                      1 1 453 455 0=256
ConvolutionDepthWise 456                      1 1 455 456 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        457                      1 1 456 457 0=256
PReLU            459                      1 1 457 459 0=256
Convolution      460                      1 1 459 460 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        461                      1 1 460 461 0=128
BinaryOp         462                      2 1 451_splitncnn_0 461 462 0=0
Split            splitncnn_9              1 2 462 462_splitncnn_0 462_splitncnn_1
Convolution      463                      1 1 462_splitncnn_1 463 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        464                      1 1 463 464 0=256
PReLU            466                      1 1 464 466 0=256
ConvolutionDepthWise 467                      1 1 466 467 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        468                      1 1 467 468 0=256
PReLU            470                      1 1 468 470 0=256
Convolution      471                      1 1 470 471 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        472                      1 1 471 472 0=128
BinaryOp         473                      2 1 462_splitncnn_0 472 473 0=0
Convolution      474                      1 1 473 474 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
BatchNorm        475                      1 1 474 475 0=512
PReLU            477                      1 1 475 477 0=512
ConvolutionDepthWise 478                      1 1 477 478 0=512 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=4608 7=512
BatchNorm        479                      1 1 478 479 0=512
PReLU            481                      1 1 479 481 0=512
Convolution      482                      1 1 481 482 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
BatchNorm        483                      1 1 482 483 0=128
Split            splitncnn_10             1 2 483 483_splitncnn_0 483_splitncnn_1
Convolution      484                      1 1 483_splitncnn_1 484 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        485                      1 1 484 485 0=256
PReLU            487                      1 1 485 487 0=256
ConvolutionDepthWise 488                      1 1 487 488 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        489                      1 1 488 489 0=256
PReLU            491                      1 1 489 491 0=256
Convolution      492                      1 1 491 492 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        493                      1 1 492 493 0=128
BinaryOp         494                      2 1 483_splitncnn_0 493 494 0=0
Split            splitncnn_11             1 2 494 494_splitncnn_0 494_splitncnn_1
Convolution      495                      1 1 494_splitncnn_1 495 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        496                      1 1 495 496 0=256
PReLU            498                      1 1 496 498 0=256
ConvolutionDepthWise 499                      1 1 498 499 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        500                      1 1 499 500 0=256
PReLU            502                      1 1 500 502 0=256
Convolution      503                      1 1 502 503 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        504                      1 1 503 504 0=128
BinaryOp         505                      2 1 494_splitncnn_0 504 505 0=0
Convolution      506                      1 1 505 506 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
BatchNorm        507                      1 1 506 507 0=512
PReLU            509                      1 1 507 509 0=512
ConvolutionDepthWise 510                      1 1 509 510 0=512 1=2 11=2 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2048 7=512
BatchNorm        511                      1 1 510 511 0=512
Convolution      512                      1 1 511 512 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
BatchNorm        513                      1 1 512 513 0=128
Reshape          521                      1 1 513 521 0=-1
InnerProduct     522                      1 1 521 522 0=2 1=1 2=256
