7767517
159 171
Input            input.1                  0 1 input.1
Convolution      334                      1 1 input.1 334 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1728
BatchNorm        335                      1 1 334 335 0=64
PReLU            337                      1 1 335 337 0=64
ConvolutionDepthWise 338                      1 1 337 338 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=576 7=64
BatchNorm        339                      1 1 338 339 0=64
PReLU            341                      1 1 339 341 0=64
Convolution      342                      1 1 341 342 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        343                      1 1 342 343 0=128
PReLU            345                      1 1 343 345 0=128
ConvolutionDepthWise 346                      1 1 345 346 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        347                      1 1 346 347 0=128
PReLU            349                      1 1 347 349 0=128
Convolution      350                      1 1 349 350 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        351                      1 1 350 351 0=64
Split            splitncnn_0              1 2 351 351_splitncnn_0 351_splitncnn_1
Convolution      352                      1 1 351_splitncnn_1 352 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        353                      1 1 352 353 0=128
PReLU            355                      1 1 353 355 0=128
ConvolutionDepthWise 356                      1 1 355 356 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        357                      1 1 356 357 0=128
PReLU            359                      1 1 357 359 0=128
Convolution      360                      1 1 359 360 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        361                      1 1 360 361 0=64
BinaryOp         362                      2 1 351_splitncnn_0 361 362 0=0
Split            splitncnn_1              1 2 362 362_splitncnn_0 362_splitncnn_1
Convolution      363                      1 1 362_splitncnn_1 363 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        364                      1 1 363 364 0=128
PReLU            366                      1 1 364 366 0=128
ConvolutionDepthWise 367                      1 1 366 367 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        368                      1 1 367 368 0=128
PReLU            370                      1 1 368 370 0=128
Convolution      371                      1 1 370 371 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        372                      1 1 371 372 0=64
BinaryOp         373                      2 1 362_splitncnn_0 372 373 0=0
Split            splitncnn_2              1 2 373 373_splitncnn_0 373_splitncnn_1
Convolution      374                      1 1 373_splitncnn_1 374 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        375                      1 1 374 375 0=128
PReLU            377                      1 1 375 377 0=128
ConvolutionDepthWise 378                      1 1 377 378 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        379                      1 1 378 379 0=128
PReLU            381                      1 1 379 381 0=128
Convolution      382                      1 1 381 382 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        383                      1 1 382 383 0=64
BinaryOp         384                      2 1 373_splitncnn_0 383 384 0=0
Split            splitncnn_3              1 2 384 384_splitncnn_0 384_splitncnn_1
Convolution      385                      1 1 384_splitncnn_1 385 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        386                      1 1 385 386 0=128
PReLU            388                      1 1 386 388 0=128
ConvolutionDepthWise 389                      1 1 388 389 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        390                      1 1 389 390 0=128
PReLU            392                      1 1 390 392 0=128
Convolution      393                      1 1 392 393 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        394                      1 1 393 394 0=64
BinaryOp         395                      2 1 384_splitncnn_0 394 395 0=0
Convolution      396                      1 1 395 396 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        397                      1 1 396 397 0=256
PReLU            399                      1 1 397 399 0=256
ConvolutionDepthWise 400                      1 1 399 400 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        401                      1 1 400 401 0=256
PReLU            403                      1 1 401 403 0=256
Convolution      404                      1 1 403 404 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        405                      1 1 404 405 0=128
Split            splitncnn_4              1 2 405 405_splitncnn_0 405_splitncnn_1
Convolution      406                      1 1 405_splitncnn_1 406 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        407                      1 1 406 407 0=256
PReLU            409                      1 1 407 409 0=256
ConvolutionDepthWise 410                      1 1 409 410 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        411                      1 1 410 411 0=256
PReLU            413                      1 1 411 413 0=256
Convolution      414                      1 1 413 414 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        415                      1 1 414 415 0=128
BinaryOp         416                      2 1 405_splitncnn_0 415 416 0=0
Split            splitncnn_5              1 2 416 416_splitncnn_0 416_splitncnn_1
Convolution      417                      1 1 416_splitncnn_1 417 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        418                      1 1 417 418 0=256
PReLU            420                      1 1 418 420 0=256
ConvolutionDepthWise 421                      1 1 420 421 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        422                      1 1 421 422 0=256
PReLU            424                      1 1 422 424 0=256
Convolution      425                      1 1 424 425 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        426                      1 1 425 426 0=128
BinaryOp         427                      2 1 416_splitncnn_0 426 427 0=0
Split            splitncnn_6              1 2 427 427_splitncnn_0 427_splitncnn_1
Convolution      428                      1 1 427_splitncnn_1 428 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        429                      1 1 428 429 0=256
PReLU            431                      1 1 429 431 0=256
ConvolutionDepthWise 432                      1 1 431 432 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        433                      1 1 432 433 0=256
PReLU            435                      1 1 433 435 0=256
Convolution      436                      1 1 435 436 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        437                      1 1 436 437 0=128
BinaryOp         438                      2 1 427_splitncnn_0 437 438 0=0
Split            splitncnn_7              1 2 438 438_splitncnn_0 438_splitncnn_1
Convolution      439                      1 1 438_splitncnn_1 439 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        440                      1 1 439 440 0=256
PReLU            442                      1 1 440 442 0=256
ConvolutionDepthWise 443                      1 1 442 443 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        444                      1 1 443 444 0=256
PReLU            446                      1 1 444 446 0=256
Convolution      447                      1 1 446 447 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        448                      1 1 447 448 0=128
BinaryOp         449                      2 1 438_splitncnn_0 448 449 0=0
Split            splitncnn_8              1 2 449 449_splitncnn_0 449_splitncnn_1
Convolution      450                      1 1 449_splitncnn_1 450 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        451                      1 1 450 451 0=256
PReLU            453                      1 1 451 453 0=256
ConvolutionDepthWise 454                      1 1 453 454 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        455                      1 1 454 455 0=256
PReLU            457                      1 1 455 457 0=256
Convolution      458                      1 1 457 458 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        459                      1 1 458 459 0=128
BinaryOp         460                      2 1 449_splitncnn_0 459 460 0=0
Split            splitncnn_9              1 2 460 460_splitncnn_0 460_splitncnn_1
Convolution      461                      1 1 460_splitncnn_1 461 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        462                      1 1 461 462 0=256
PReLU            464                      1 1 462 464 0=256
ConvolutionDepthWise 465                      1 1 464 465 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        466                      1 1 465 466 0=256
PReLU            468                      1 1 466 468 0=256
Convolution      469                      1 1 468 469 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        470                      1 1 469 470 0=128
BinaryOp         471                      2 1 460_splitncnn_0 470 471 0=0
Convolution      472                      1 1 471 472 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
BatchNorm        473                      1 1 472 473 0=512
PReLU            475                      1 1 473 475 0=512
ConvolutionDepthWise 476                      1 1 475 476 0=512 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=4608 7=512
BatchNorm        477                      1 1 476 477 0=512
PReLU            479                      1 1 477 479 0=512
Convolution      480                      1 1 479 480 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
BatchNorm        481                      1 1 480 481 0=128
Split            splitncnn_10             1 2 481 481_splitncnn_0 481_splitncnn_1
Convolution      482                      1 1 481_splitncnn_1 482 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        483                      1 1 482 483 0=256
PReLU            485                      1 1 483 485 0=256
ConvolutionDepthWise 486                      1 1 485 486 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        487                      1 1 486 487 0=256
PReLU            489                      1 1 487 489 0=256
Convolution      490                      1 1 489 490 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        491                      1 1 490 491 0=128
BinaryOp         492                      2 1 481_splitncnn_0 491 492 0=0
Split            splitncnn_11             1 2 492 492_splitncnn_0 492_splitncnn_1
Convolution      493                      1 1 492_splitncnn_1 493 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        494                      1 1 493 494 0=256
PReLU            496                      1 1 494 496 0=256
ConvolutionDepthWise 497                      1 1 496 497 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        498                      1 1 497 498 0=256
PReLU            500                      1 1 498 500 0=256
Convolution      501                      1 1 500 501 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        502                      1 1 501 502 0=128
BinaryOp         503                      2 1 492_splitncnn_0 502 503 0=0
Convolution      504                      1 1 503 504 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
BatchNorm        505                      1 1 504 505 0=512
PReLU            507                      1 1 505 507 0=512
ConvolutionDepthWise 508                      1 1 507 508 0=512 1=7 11=7 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=25088 7=512
BatchNorm        509                      1 1 508 509 0=512
Convolution      510                      1 1 509 510 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
BatchNorm        511                      1 1 510 511 0=128
Reshape          519                      1 1 511 519 0=-1
